[
  {
    "id": "dog001",
    "type": "dog",
    "name": "Buddy",
    "breed": "Golden Retriever",
    "gender": "Male",
    "age": "3 years",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "London Centre",
    "about": "Hi, I’m Buddy! I’m a gentle and loyal Golden Retriever who adores belly rubs and playing fetch in the park. I get along great with kids and other dogs, and I’m always ready for a cuddle. I’ve been trained in basic commands and love to show off when given a treat. If you’re looking for a fun-loving, dependable companion, I’m your guy!",
    "shortDescription": "Gentle and loyal Golden Retriever who loves kids, other dogs, and a good game of fetch.",
    "image": "../images/dogs/buddy.jpg"
  },
  {
    "id": "dog002",
    "type": "dog",
    "name": "Max",
    "breed": "Labrador Retriever",
    "gender": "Male",
    "age": "4 years",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "Manchester Rescue",
    "about": "Max is a big, goofy sweetheart who lights up every room he enters. He’s incredibly friendly and loves everyone he meets — human or animal. Long walks and tug-of-war games are his favourite activities, followed by long naps in the sun. Max has been through basic obedience training and loves learning new tricks. He’d be a perfect addition to an active family looking for a lovable sidekick.",
    "shortDescription": "Friendly, playful Labrador who enjoys walks, games, and sunny naps.",
    "image": "../images/dogs/max.webp",
     "reserved": true
  },
  {
    "id": "dog003",
    "type": "dog",
    "name": "Luna",
    "breed": "Border Collie",
    "gender": "Female",
    "age": "2 years",
    "goodWithChildren": true,
    "goodWithOtherPets": false,
    "location": "Liverpool Dogs Home",
    "about": "Luna is an energetic and intelligent Border Collie with a love for adventure. She excels at puzzle games, fetch, and agility activities. Luna needs daily mental stimulation and would thrive with someone who has an active lifestyle. She’s not very fond of other pets, so she should be the only furry friend in the household. If you’re ready to keep up with her pace, she’ll reward you with unwavering loyalty.",
    "shortDescription": "Energetic Border Collie who loves adventures and needs an active home.",
    "image": "../images/dogs/luna.jpg"
  },
  {
    "id": "dog004",
    "type": "dog",
    "name": "Rocky",
    "breed": "Staffordshire Bull Terrier",
    "gender": "Male",
    "age": "6 years",
    "goodWithChildren": false,
    "goodWithOtherPets": false,
    "location": "Glasgow Animal Centre",
    "about": "Rocky is a strong, independent boy who prefers being the centre of attention. He’s had a rough start to life, but with the right person, he can become incredibly loyal and loving. Rocky doesn’t get along with other animals or young children, so he’s best as the only pet. He enjoys tug-of-war, sturdy chew toys, and lounging in a sunny spot. If you have experience with large breeds, Rocky could be your perfect pal.",
    "shortDescription": "Strong, loyal Staffordshire Bull Terrier best as the only pet in the home.",
    "image": "../images/dogs/rocky.jpg"
  },
  {
    "id": "dog005",
    "type": "dog",
    "name": "Bailey",
    "breed": "Beagle",
    "gender": "Female",
    "age": "5 years",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "Bristol Shelter",
    "about": "Bailey is a curious and cheerful Beagle with a nose for adventure. She loves long walks and sniffing everything in sight. Her favourite activities include digging into puzzle toys and curling up in a blanket. Bailey does well in homes with kids and other pets, especially if she gets attention and treats. She’s a happy-go-lucky companion with a playful spirit.",
    "shortDescription": "Cheerful Beagle who loves walks, sniffing adventures, and family life.",
    "image": "../images/dogs/bailey.jpg"
  },
  {
    "id": "dog006",
    "type": "dog",
    "name": "Charlie",
    "breed": "Cocker Spaniel",
    "gender": "Male",
    "age": "2 years",
    "goodWithChildren": true,
    "goodWithOtherPets": false,
    "location": "Sheffield Pet Haven",
    "about": "Charlie is an affectionate and intelligent Cocker Spaniel who loves to be part of the family. He bonds closely with his humans and enjoys cuddling as much as playtime. Charlie prefers to be the only pet, as he likes having all the attention. He’s very food-motivated and learns quickly with positive reinforcement. If you’re looking for a clever dog who loves love, Charlie is for you.",
    "shortDescription": "Affectionate Cocker Spaniel who prefers being the only pet and loves cuddles.",
    "image": "../images/dogs/charlie.jpg",
     "reserved": true
  },
  {
    "id": "dog007",
    "type": "dog",
    "name": "Rex",
    "breed": "German Shepherd",
    "gender": "Male",
    "age": "5 years",
    "goodWithChildren": true,
    "goodWithOtherPets": false,
    "location": "Edinburgh Canine Rescue",
    "about": "Rex is a noble, alert, and loyal German Shepherd who thrives in structured environments. He has been trained extensively and responds well to commands. Rex is best in a home without other animals where he can be the star. He loves a job to do and would excel with someone active or experienced with the breed. Protective but loving, Rex is a loyal guardian and friend.",
    "shortDescription": "Loyal German Shepherd who thrives with structure and experienced owners.",
    "image": "../images/dogs/rex.jpg"
  },
  {
    "id": "dog008",
    "type": "dog",
    "name": "Daisy",
    "breed": "Cavapoo",
    "gender": "Female",
    "age": "1 year",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "Reading Paws Centre",
    "about": "Daisy is a fluffy, happy Cavapoo who is full of energy and kisses. She’s great with kids, other dogs, and pretty much anyone who gives her a scratch behind the ears. Daisy is still learning about the world but is eager to please and pick up new tricks. Her sweet nature makes her a joy to be around. If you want a loving, playful pup, Daisy is your girl.",
    "shortDescription": "Playful Cavapoo who adores people, other pets, and learning new tricks.",
    "image": "../images/dogs/daisy.webp"
  },
  {
    "id": "dog009",
    "type": "dog",
    "name": "Toby",
    "breed": "Shih Tzu",
    "gender": "Male",
    "age": "7 years",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "Yorkshire Dog Shelter",
    "about": "Toby is a small, calm Shih Tzu who loves lounging on laps and sunlit windowsills. He’s an older gentleman who enjoys a slower pace and quiet company. Toby is affectionate and well-mannered, making him great for first-time pet owners or seniors. He enjoys short walks and lots of petting. If you want a low-maintenance companion who loves attention, Toby fits the bill.",
    "shortDescription": "Calm, loving Shih Tzu perfect for a relaxed and gentle home.",
    "image": "../images/dogs/toby.jpg"
  }
]
