[
  {
    "id": "dog001",
    "type": "dog",
    "name": "Buddy",
    "breed": "Golden Retriever",
    "gender": "Male",
    "age": "3 years",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "London Centre",
    "about": "Hi, I’m Buddy! I’m a gentle and loyal Golden Retriever who adores belly rubs and playing fetch in the park. I get along great with kids and other dogs, and I’m always ready for a cuddle. I’ve been trained in basic commands and love to show off when given a treat. If you’re looking for a fun-loving, dependable companion, I’m your guy!",
    "image": "../images/dogs/buddy.jpg"
  },
  {
    "id": "dog002",
    "type": "dog",
    "name": "Max",
    "breed": "Labrador Retriever",
    "gender": "Male",
    "age": "4 years",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "Manchester Rescue",
    "about": "Max is a big, goofy sweetheart who lights up every room he enters. He’s incredibly friendly and loves everyone he meets — human or animal. Long walks and tug-of-war games are his favourite activities, followed by long naps in the sun. Max has been through basic obedience training and loves learning new tricks. He’d be a perfect addition to an active family looking for a lovable sidekick.",
    "image": "../images/dogs/max.webp"
  },
  {
    "id": "dog003",
    "type": "dog",
    "name": "Luna",
    "breed": "Border Collie",
    "gender": "Female",
    "age": "2 years",
    "goodWithChildren": true,
    "goodWithOtherPets": false,
    "location": "Liverpool Dogs Home",
    "about": "Luna is an energetic and intelligent Border Collie with a love for adventure. She excels at puzzle games, fetch, and agility activities. Luna needs daily mental stimulation and would thrive with someone who has an active lifestyle. She’s not very fond of other pets, so she should be the only furry friend in the household. If you’re ready to keep up with her pace, she’ll reward you with unwavering loyalty.",
    "image": "../images/dogs/luna.jpg"
  },
  {
    "id": "dog004",
    "type": "dog",
    "name": "Rocky",
    "breed": "Staffordshire Bull Terrier",
    "gender": "Male",
    "age": "6 years",
    "goodWithChildren": false,
    "goodWithOtherPets": false,
    "location": "Glasgow Animal Centre",
    "about": "Rocky is a strong, independent boy who prefers being the centre of attention. He’s had a rough start to life, but with the right person, he can become incredibly loyal and loving. Rocky doesn’t get along with other animals or young children, so he’s best as the only pet. He enjoys tug-of-war, sturdy chew toys, and lounging in a sunny spot. If you have experience with large breeds, Rocky could be your perfect pal.",
    "image": "../images/dogs/rocky.jpg"
  },
  {
    "id": "dog005",
    "type": "dog",
    "name": "Bailey",
    "breed": "Beagle",
    "gender": "Female",
    "age": "5 years",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "Bristol Shelter",
    "about": "Bailey is a curious and cheerful Beagle with a nose for adventure. She loves long walks and sniffing everything in sight. Her favourite activities include digging into puzzle toys and curling up in a blanket. Bailey does well in homes with kids and other pets, especially if she gets attention and treats. She’s a happy-go-lucky companion with a playful spirit.",
    "image": "../images/dogs/bailey.jpg"
  },
  {
    "id": "dog006",
    "type": "dog",
    "name": "Charlie",
    "breed": "Cocker Spaniel",
    "gender": "Male",
    "age": "2 years",
    "goodWithChildren": true,
    "goodWithOtherPets": false,
    "location": "Sheffield Pet Haven",
    "about": "Charlie is an affectionate and intelligent Cocker Spaniel who loves to be part of the family. He bonds closely with his humans and enjoys cuddling as much as playtime. Charlie prefers to be the only pet, as he likes having all the attention. He’s very food-motivated and learns quickly with positive reinforcement. If you’re looking for a clever dog who loves love, Charlie is for you.",
    "image": "../images/dogs/charlie.jpg"
  },
  {
    "id": "dog007",
    "type": "dog",
    "name": "Rex",
    "breed": "German Shepherd",
    "gender": "Male",
    "age": "5 years",
    "goodWithChildren": true,
    "goodWithOtherPets": false,
    "location": "Edinburgh Canine Rescue",
    "about": "Rex is a noble, alert, and loyal German Shepherd who thrives in structured environments. He has been trained extensively and responds well to commands. Rex is best in a home without other animals where he can be the star. He loves a job to do and would excel with someone active or experienced with the breed. Protective but loving, Rex is a loyal guardian and friend.",
    "image": "../images/dogs/rex.jpg"
  },
  {
    "id": "dog008",
    "type": "dog",
    "name": "Daisy",
    "breed": "Cavapoo",
    "gender": "Female",
    "age": "1 year",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "Reading Paws Centre",
    "about": "Daisy is a fluffy, happy Cavapoo who is full of energy and kisses. She’s great with kids, other dogs, and pretty much anyone who gives her a scratch behind the ears. Daisy is still learning about the world but is eager to please and pick up new tricks. Her sweet nature makes her a joy to be around. If you want a loving, playful pup, Daisy is your girl.",
    "image": "../images/dogs/daisy.webp"
  },
  {
    "id": "dog009",
    "type": "dog",
    "name": "Toby",
    "breed": "Shih Tzu",
    "gender": "Male",
    "age": "7 years",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "Yorkshire Dog Shelter",
    "about": "Toby is a small, calm Shih Tzu who loves lounging on laps and sunlit windowsills. He’s an older gentleman who enjoys a slower pace and quiet company. Toby is affectionate and well-mannered, making him great for first-time pet owners or seniors. He enjoys short walks and lots of petting. If you want a low-maintenance companion who loves attention, Toby fits the bill.",
    "image": "../images/dogs/toby.jpg"
  },

  {
    "id": "cat001",
    "type": "cat",
    "name": "Mittens",
    "breed": "British Shorthair",
    "gender": "Female",
    "age": "2 years",
    "goodWithChildren": true,
    "goodWithOtherPets": false,
    "location": "Birmingham Shelter",
    "about": "Mittens is a calm, affectionate cat who enjoys quiet afternoons by the window. She thrives in peaceful environments and is best suited for a home where she’s the only pet. She enjoys being gently brushed and will softly purr when content. Mittens is great with older kids and adults who understand her boundaries. If you're seeking a low-key lap cat, she may be your perfect match.",
    "image": "../images/cats/mittens.webp"
  },
  {
    "id": "cat002",
    "type": "cat",
    "name": "Shadow",
    "breed": "Maine Coon",
    "gender": "Male",
    "age": "5 years",
    "goodWithChildren": false,
    "goodWithOtherPets": true,
    "location": "Leeds Cat Haven",
    "about": "Shadow is a quiet, majestic cat who prefers calm over chaos. He can be shy at first, but once he warms up to you, he becomes incredibly affectionate. He gets along with other cats but would prefer a home without children. Shadow enjoys lounging in high places and being stroked behind the ears. He’s the ideal companion for a patient cat lover who appreciates a slow-burning bond.",
    "image": "../images/cats/shadow.jpg"
  },
  {
    "id": "cat003",
    "type": "cat",
    "name": "Peanut",
    "breed": "Siamese",
    "gender": "Female",
    "age": "1 year",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "Nottingham Cat Shelter",
    "about": "Peanut is a curious and vocal Siamese with a big personality in a small body. She loves to climb, play with feathers, and follow her humans around the house. She enjoys being around people and is always up for a chat. Peanut does well with children and other pets who can keep up with her energy. If you're looking for a cat with sass and sweetness, Peanut is your girl.",
    "image": "../images/cats/peanut.jpeg"
  },
  {
    "id": "cat004",
    "type": "cat",
    "name": "Leo",
    "breed": "Bengal",
    "gender": "Male",
    "age": "3 years",
    "goodWithChildren": false,
    "goodWithOtherPets": false,
    "location": "Brighton Feline Centre",
    "about": "Leo is an adventurous and independent Bengal cat who loves to climb and explore. He has a bold personality and prefers a home where he can roam freely. Leo isn’t fond of being picked up, but enjoys head scratches and playtime. He's best suited for experienced cat owners. If you want a wild-hearted feline, Leo is a striking and lively companion.",
    "image": "../images/cats/leo.jpg"
  },
  {
    "id": "cat005",
    "type": "cat",
    "name": "Willow",
    "breed": "Ragdoll",
    "gender": "Female",
    "age": "4 years",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "Cardiff Cat Rescue",
    "about": "Willow is a soft-hearted Ragdoll who loves attention and gentle affection. She’s laid-back and loves being near her humans. She’s great with kids, dogs, and other cats, and does best in cozy home environments. Willow enjoys stretching out in the sun and sleeping on soft blankets. She's an ideal choice for anyone looking for a calm, sweet companion.",
    "image": "../images/cats/willow.jpg"
  },
  {
    "id": "cat006",
    "type": "cat",
    "name": "Oreo",
    "breed": "Tuxedo",
    "gender": "Male",
    "age": "6 months",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "Leicester Kitten House",
    "about": "Oreo is a playful and mischievous kitten who loves zooming around the room. He’s very sociable and gets along with everyone. Oreo is full of energy and curiosity, and he needs plenty of toys and interaction. He’s especially great for families with children. If you want entertainment and cuteness in one package, Oreo is a perfect match.",
    "image": "../images/cats/oreo.webp"
  },
  {
    "id": "cat007",
    "type": "cat",
    "name": "Nala",
    "breed": "Russian Blue",
    "gender": "Female",
    "age": "3 years",
    "goodWithChildren": true,
    "goodWithOtherPets": false,
    "location": "Coventry Animal Shelter",
    "about": "Nala is an elegant, gentle Russian Blue who enjoys peaceful environments and a bit of quiet company. She’s affectionate but not clingy, preferring to come to you when she wants attention. Nala prefers to be the only pet in the home. She’s the perfect roommate for someone who works from home and enjoys a calm atmosphere. Her green eyes and sleek coat make her truly special.",
    "image": "../images/cats/nala.webp"
  },
  {
    "id": "cat008",
    "type": "cat",
    "name": "Smudge",
    "breed": "Domestic Short Hair",
    "gender": "Male",
    "age": "2 years",
    "goodWithChildren": true,
    "goodWithOtherPets": true,
    "location": "Newcastle Cat Shelter",
    "about": "Smudge is a relaxed and friendly guy who’s happy to curl up wherever you are. He’s low-maintenance and affectionate, happy to spend his day napping or watching birds out the window. He enjoys being pet and handled, making him great for families or first-time cat owners. Smudge is adaptable and easy-going. If you want a stress-free cat experience, Smudge is your guy.",
    "image": "../images/cats/smudge.jpg"
  },
  {
    "id": "cat009",
    "type": "cat",
    "name": "Tilly",
    "breed": "Calico",
    "gender": "Female",
    "age": "1 year",
    "goodWithChildren": true,
    "goodWithOtherPets": false,
    "location": "Oxford Pet Rescue",
    "about": "Tilly is a spirited Calico with a quirky personality and loads of charm. She enjoys playtime and has a talent for chasing anything that moves. Tilly prefers to be the queen of the castle, so she’d do best as an only pet. She bonds quickly with her humans and loves to be talked to. If you want a cat with attitude and affection, Tilly is ready to rule your home.",
    "image": "../images/cats/tilly.jpg"
  }
]